<template>
  <div class="about-page pa-5 pt-10">
    <div class="text-h4 mt-5 cyan--text">
      ಭಾರತೀಯ ಪ್ರಾದೇಶಿಕ ಭಾಷೆಗಳಲ್ಲಿ ಕರ್ತೃತ್ವದ ಪರೀಕ್ಷೆಗಾಗಿ ತಾಕ್ಷಣಿಕ ಗಣಕೀಯ ಭಾಷಾ
      ಶಾಸ್ತ್ರೀಯ ಕ್ರಮಾವಳಿಗಳ (ಅಲ್ಗಾರಿದಮ್‌ಗಳ) ಅಭಿವೃದ್ಧಿ ಮತ್ತು ವಿಶ್ಲೇಷಣೆ
    </div>
    <p class="mt-6">
      ಕರ್ತೃತ್ವ ಪರೀಕ್ಷೆಯು ಸಹಜ ಭಾಷಾ ಸಂಸ್ಕರಣೆಯ ಜನಪ್ರಿಯ ಅನ್ವಯಗಳಲ್ಲಿ ಒಂದಾಗಿದೆ. ಇದು
      ಕರ್ತೃವಿನ ಬರವಣಿಗೆಯ ಶೈಲಿಯ ಆಧಾರದ ಮೇಲೆ ದತ್ತ ಪಠ್ಯದ ಲೇಖಕರು ಯಾರು ಎಂಬುದರ
      ಸಂಭವನೀಯತೆಯನ್ನು ಊಹಿಸುವ ಕಾರ್ಯವಾಗಿದೆ. ದಕ್ಷಿಣ ಭಾರತದ ಜನಪ್ರಿಯ ಭಾಷೆಗಳಲ್ಲಿ
      ಒಂದಾಗಿರುವ ಕನ್ನಡವು ಈ ಕ್ಷೇತ್ರದಲ್ಲಿ ಹಿಂದುಳಿದಿದೆ. ಇದು ಕರ್ನಾಟಕದ ರಾಜ್ಯ
      ಭಾಷೆಯಾಗಿದೆ ಮತ್ತು ಜಗತ್ತಿನಾದ್ಯಂತ ಆರು ಕೋಟಿಗೂ ಹೆಚ್ಚು ಜನರು ಮಾತನಾಡುತ್ತಾರೆ. ಕನ್ನಡ
      ಭಾಷೆಯು ಶಬ್ದಕೋಶ, ವ್ಯಾಕರಣ ಮತ್ತು ಸಾಹಿತ್ಯಗಳಲ್ಲಿ ಶ್ರೀಮಂತವಾಗಿದೆ. ಅನೇಕ ಭಾರತೀಯ
      ಪ್ರಾದೇಶಿಕ ಭಾಷೆಗಳಲ್ಲಿ ಪಠ್ಯ ಸಂಸ್ಕರಣೆಯು ಹೆಚ್ಚು ಪ್ರಗತಿಯಲ್ಲಿದೆ. ಆದರೆ ಕನ್ನಡದಲ್ಲಿ
      ಇದು ಇನ್ನೂ ಆರಂಭಿಕ ಹಂತದಲ್ಲಿದೆ. ಪ್ರಸ್ತಾವಿತ ಅನ್ವಯವು ಮುಖ್ಯವಾಗಿ ಶೈಲಿಮಾಪನ
      (ಸ್ಟೈಲೋಮೆಟ್ರಿ) ವೈಶಿಷ್ಟ್ಯಗಳ ಆಧಾರದ ಮೇಲೆ ಅಜ್ಞಾತ ಕನ್ನಡ ಪಠ್ಯದ ಕರ್ತೃತ್ವವನ್ನು
      ಊಹಿಸುವುದರ ಕುರಿತು ಗಮನ ನೀಡುತ್ತದೆ.
    </p>
    <div class="approaches">
      <div v-for="(approach, index) in approaches" :key="index">
        <Card :data="approach" />
      </div>
    </div>
    <div class="text-h4 cyan--text">ಸಾಮಾಜಿಕ ಪರಿಣಾಮ</div>
    <p class="mt-6">
      ಪ್ರಸ್ತಾವಿತ ಅನ್ವಯವನ್ನು ಕನ್ನಡ ಪಠ್ಯ ಸಂಸ್ಕರಣಾ ಕ್ಷೇತ್ರಕ್ಕೆ ಗಣನೀಯವಾಗಿ ಕೊಡುಗೆ
      ನೀಡಿರುವ ಸ್ವಯಂಸೇವಾ ಸಂಸ್ಥೆ ಕನ್ನಡ ಗಣಕ ಪರಿಷತ್ತಿಗೆ ಕೊಡುಗೆಯಾಗಿ ನೀಡಲಾಗುವುದು.
      ಕನ್ನಡ ಗಣಕ ಪರಿಷತ್ತು ಈ ಕೆಲಸಕ್ಕಾಗಿ ಬೃಹತ್ ಮಾಹಿತಿ ಸಂಚಯವನ್ನು ಕೊಡುಗೆಯಾಗಿ ನೀಡಿದೆ.
      ಭವಿಷ್ಯದಲ್ಲಿ ಸಾಹಿತ್ಯದಲ್ಲಿ ಯಾವುದೇ ಕರ್ತೃತ್ವದ ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು ಕನ್ನಡ ಗಣಕ
      ಪರಿಷತ್ತು ಈ ಸೌಲಭ್ಯವನ್ನು ಬಳಸಿಕೊಳ್ಳುತ್ತದೆ. ಮುಂದೆ ಈ ಕರ್ತೃತ್ವ ಪರೀಕ್ಷೆಯ
      ಅನ್ವಯವನ್ನು ಪೂರ್ಣ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ನಿರ್ವಹಿಸುವಂತಹ ಅನ್ವಯಸೌಲಭ್ಯವಾಗಿ
      ಅಭಿವೃದ್ಧಿಪಡಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ಅದನ್ನು ಸಾರ್ವಜನಿಕ ಬಳಕೆಗೆ ಬಿಡುಗಡೆ ಮಾಡಲಾಗುತ್ತದೆ.
    </p>
    <div class="text-h4 cyan--text mt-8">ಲೇಖಕರು ಮತ್ತು ಮೇಲ್ವಿಚಾರಕರು</div>
    <div class="professors mt-8">
      <div v-for="(professor, index) in professors" :key="index">
        <ProfessorCard :data="professor" />
      </div>
    </div>
    <div class="bottom-space mt-15"></div>
  </div>
</template>

<script>
import Card from "../components/design/Card.vue";
import ProfessorCard from "../components/design/ProfessorCard.vue";
export default {
  components: { Card, ProfessorCard },
  data() {
    return {
      approaches: [
        {
          imgName: "profile",
          title: "ಸ್ವರೂಪ ಲಕ್ಷಣ ಆಧಾರಿತ ವಿಧಾನ",
          description:
            "ಪದಗಳ ಆವರ್ತನ/ ಅಕ್ಷರ/ ನಾಮಪದಗಳು/ಸರ್ವನಾಮಗಳು/ ಪದ ಜೋಡಿಯಂತಹ ಶಬ್ದಕೋಶೀಯ   ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ಹೊರತೆಗೆಯಲಾಗುತ್ತದೆ ಮತ್ತು ನಂತರ ವಿವಿಧ ವರ್ಗೀಕರಣ ಕ್ರಮಾವಳಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ವರ್ಗೀಕರಿಸಲಾಗುತ್ತದೆ.",
        },
        {
          imgName: "lstm",
          title: "ದ್ವಿ-ದಿಕ್ಕಿನ ಎಲ್‌ ಎಸ್‌ ಟಿ ಎಂ ತಂತ್ರ",
          description:
            "ವ್ಯಾಕರಣರೂಪದ ಗುರುತುಗಳಂತಹ  ವಾಕ್ಯರಚನಾತ್ಮಕ  ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ದೀರ್ಘ ಅಲ್ಪಕಾಲಿಕ ಸ್ಮೃತಿ ಜಾಲವನ್ನು  ಬಳಸಿ ಹೊರತೆಗೆಯಲಾಗುತ್ತದೆ ಮತ್ತು ವರ್ಗೀಕರಿಸಲಾಗುತ್ತದೆ",
        },
        {
          imgName: "instance",
          title: "ನಿದರ್ಶನ ಆಧಾರಿತ ವಿಧಾನ",
          description:
            "ಪದ ಮತ್ತು ಅಕ್ಷರ  -ಎನ್‌  ಗ್ರಾಂ(ವಾಕ್ಯ ಅಥವಾ ಪದಖಂಡದಲ್ಲಿ ಕ್ರಮವಾಗಿ, ಪಕ್ಕಪಕ್ಕದಲ್ಲಿ ಬರುವ ಅಕ್ಷರ, ಪದ ಅಥವಾ ಪದಜೋಡಿಗಳ ಸಂಖ್ಯೆ) ಗಳನ್ನು ಬಳಸಿಕೊಂಡು ವಾಕ್ಯರಚನಾತ್ಮಕ ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ಗುರುತಿಸಲಾಗುತ್ತದೆ  ಮತ್ತು ವಿವಿಧ ವರ್ಗೀಕರಣ ಕ್ರಮಾವಳಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ವರ್ಗೀಕರಿಸಲಾಗುತ್ತದೆ.",
        },
        {
          imgName: "compression",
          title: "ಸಂಕೋಚನ ಆಧಾರಿತ ವಿಧಾನ",
          description:
            "ದತ್ತ ಪಠ್ಯದ ಕರ್ತೃವಿನ ಸಂಭವನೀಯತೆಯನ್ನು ಊಹಿಸಲು Zip, Gzip, Bzip, LZMA ಮತ್ತು PPmd ಸಂಕೋಚನ ಕ್ರಮಾವಳಿಗಳನ್ನು ಅನ್ವಯಿಸಲಾಗಿದೆ.",
        },
        {
          imgName: "graph",
          title: "ಗ್ರಾಫ್ ಆಧಾರಿತ ವಿಧಾನ",
          description:
            "ಲೇಖಕ ಮತ್ತು ಅವರ ಲೇಖನಗಳನ್ನು ಸಂಪರ್ಕಿತ ಗ್ರಾಫ್‌ನಂತೆ ಪ್ರತಿನಿಧಿಸುವುದು ನಂತರ ಅಕ್ಷರ ಮತ್ತು ಪದ N-ಗ್ರಾಂ ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ಹೊರತೆಗೆಯುವುದು ಮತ್ತು ಕನ್ವಲ್ಯೂಷನ್ ನ್ಯೂರಲ್ ನೆಟ್‌ವರ್ಕ್ (ಜಟಿಲ ನರತಂತು ವ್ಯೂಹವನ್ನು ) ಬಳಸಿಕೊಂಡು ವರ್ಗೀಕರಣವನ್ನು ನಿರ್ವಹಿಸುವುದು.",
        },
      ],
      professors: [
        {
          imgName: "chandrika",
          name: "ಶ್ರೀಮತಿ. ಚಂದ್ರಿಕಾ ಪ್ರಸಾದ್",
          role: "ಲೇಖಕರು",
          designation:
            "ಕಂಪ್ಯೂಟರ್ ಸೈನ್ಸ್ ಮತ್ತು ಇಂಜಿನಿಯರಿಂಗ್ ವಿಭಾಗದಲ್ಲಿ ಸಂಶೋಧನಾ ವಿಧ್ಯಾರ್ಥಿ",
          college: "Ramaiah Institute of Technology",
        },
        {
          imgName: "jaggi",
          role: "ಮೇಲ್ವಿಚಾರಕರು",
          name: "ಡಾ. ಜಗದೀಶ ಕಳ್ಳಿಮನಿ",
          designation:
            "ಪ್ರೊಫೆಸರ್ ಮತ್ತು ಮುಖ್ಯಸ್ಥರು- ಆರ್ಟಿಫಿಶಿಯಲ್ ಇಂಟೆಲಿಜೆನ್ಸ್ ಮತ್ತು ಮೆಷಿನ್ ಲರ್ನಿಂಗ್ ",
          college: "Ramaiah Institute of Technology",
        },
      ],
    };
  },
};
</script>

<style lang="scss" scoped>
.approaches {
  width: 100%;
  display: flex;
  justify-content: space-between;
  align-items: stretch;
  margin: 2rem 0;
  flex-wrap: wrap;
}
.professors {
  width: 100%;
  display: flex;
  flex-wrap: wrap;
}
</style>